public/man/man1/spa-acp-tool.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - spa-acp-tool.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - spa-acp-tool.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>spa-acp-tool - The PipeWire ALSA profile debugging utility</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>spa-acp-tool</strong> [/COMMAND/]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Debug tool for exercising the ALSA card profile probing code, without
running PipeWire.</p>
<p>
May be used to debug problems where PipeWire has incorrectly functioning
ALSA card profiles.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
COMMANDS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>help | h</strong></p>
<blockquote>
<p>Show available commands</p>
</blockquote>
<p>
<strong>quit | q</strong></p>
<blockquote>
<p>Quit</p>
</blockquote>
<p>
<strong>card ID | c ID</strong></p>
<blockquote>
<p>Probe card</p>
</blockquote>
<p>
<strong>info | i</strong></p>
<blockquote>
<p>List card info</p>
</blockquote>
<p>
<strong>list | l</strong></p>
<blockquote>
<p>List all objects</p>
</blockquote>
<p>
<strong>list-verbose | lv</strong></p>
<blockquote>
<p>List all data</p>
</blockquote>
<p>
<strong>list-profiles [ID] | lpr [ID]</strong></p>
<blockquote>
<p>List profiles</p>
</blockquote>
<p>
<strong>set-profile ID | spr ID</strong></p>
<blockquote>
<p>Activate a profile</p>
</blockquote>
<p>
<strong>list-ports [ID] | lp [ID]</strong></p>
<blockquote>
<p>List ports</p>
</blockquote>
<p>
<strong>set-port ID | sp ID</strong></p>
<blockquote>
<p>Activate a port</p>
</blockquote>
<p>
<strong>list-devices [ID] | ld [ID]</strong></p>
<blockquote>
<p>List available devices</p>
</blockquote>
<p>
<strong>get-volume ID | gv ID</strong></p>
<blockquote>
<p>Get volume from device</p>
</blockquote>
<p>
<strong>set-volume ID VOL | v ID VOL</strong></p>
<blockquote>
<p>Set volume on device</p>
</blockquote>
<p>
<strong>inc-volume ID | v+ ID</strong></p>
<blockquote>
<p>Increase volume on device</p>
</blockquote>
<p>
<strong>dec-volume ID | v- ID</strong></p>
<blockquote>
<p>Decrease volume on device</p>
</blockquote>
<p>
<strong>get-mute ID | gm ID</strong></p>
<blockquote>
<p>Get mute state from device</p>
</blockquote>
<p>
<strong>set-mute ID VAL | sm ID VAL</strong></p>
<blockquote>
<p>Set mute on device</p>
</blockquote>
<p>
<strong>toggle-mute ID | m ID</strong></p>
<blockquote>
<p>Toggle mute on device</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
AUTHORS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The PipeWire Developers
&lt;<a href="https://gitlab.freedesktop.org/pipewire/pipewire/issues">https://gitlab.freedesktop.org/pipewire/pipewire/issues</a>&gt;; PipeWire is
available from &lt;<a href="https://pipewire.org">https://pipewire.org</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p><strong>pipewire(1)</strong></p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
